
export const cipDefaultAirportOptions : {
    url:string;
    id:number;
    name:string;
}[] = [
    {
      "url": "fa/cip/فرودگاه-بین-المللی-امام-خمینی-Cip-خدمات",
      "name": "فرودگاه بین المللی امام خمینی",
      "id": 9131
    },
    {
      "url": "fa/cip/فرودگاه-مهرآباد-Cip-خدمات",
      "name": "فرودگاه مهرآباد",
      "id": 9116
    },
    {
      "url": "fa/cip/فرودگاه-کیش-Cip-خدمات",
      "name": "فرودگاه بین المللی کیش",
      "id": 9117
    },
    {
      "url": "fa/cip/فرودگاه-شهید-هاشمی-نژاد-مشهد-Cip-خدمات",
      "name": "فرودگاه بین المللی شهید هاشمی نژاد مشهد",
      "id": 9121
    },
    {
      "url": "fa/cip/فرودگاه-شهید-اشرفی-اصفهانی-کرمانشاه-Cip-خدمات",
      "name": "فرودگاه شهید اشرفی کرمانشاه",
      "id": 9137
    },
    {
      "url": "fa/cip/فرودگاه-اهواز-Cip-خدمات",
      "name": "فرودگاه سپهبد شهید قاسم سلیمانی اهواز",
      "id": 9146
    },
    {
      "url": "fa/cip/فرودگاه-شهید-مدنی-تبریز-Cip-خدمات",
      "name": "فرودگاه بین المللی شهید مدنی تبریز",
      "id": 9152
    },
    {
      "url": "fa/cip/فرودگاه-بین-المللی-سردار-جنگل-رشت-Cip-خدمات",
      "name": "فرودگاه بین المللی سردار جنگل رشت",
      "id": 9155
    }
  ]